/*
实验目的：1、掌握线性表的基本知识 2、深入理解、掌握并灵活运用线性表。3、熟练掌握线性表的存储结构及主要运算的实现 已知顺序表L递增有序，将X插入到线性表的适当位置上，保证线性表有序。。

输入格式:
第1行输入顺序表长度，第2行输入递增有序的顺序表，第3行输入要插入的数据元素X。

输出格式:
对每一组输入，在一行中输出插入X后的递增的顺序表。

输入样例:
5
1 3 5 7 9
6

输出样例:
1,3,5,6,7,9,
*/

#include<stdio.h>
int main(){
	int n, k, i; // n为顺序表长度, k为插入的数字
	scanf("%d",&n);
	int sum[n]; // 递增有序的顺序表
	for(i=0; i<n; i++) {
		scanf("%d",&sum[i]);
	}
	scanf("%d",&k);
    for(i=0; i<n; i++) {
        if(k<=sum[i]) {
            for(int j=n-1; j>=i; j--) {
                sum[j+1] = sum[j];
            }
            sum[i] = k;
            n++;
            break;
        }
    }
    if(i==n) {  // i为前面for循环中找到的大于或等于k的下标，即当输入的数字是整个顺序表中最大的数字时
		 sum[n] = k;
		 for(i=0; i<n+1; i++)
             printf("%d,", sum[i]);
	 } else {
		for(i=0; i<n; i++)
            printf("%d,", sum[i]);
	}
}
